#1st program
print(9**0.5*5)
#2nd program
print(9.99>9.98 and 1000!=1000.1)
#3rd program # вариант через преобразование типов данных
print((int('1234'[1:3]))+(int('5678'[1:3])))
#3rd program # вариант через целочисленное деление
a = 1234
b = 5678
print(a%1000//10+b%1000//10)
#program 4th # вариант через преобразование типов данных
print((int('13.42'[0:2]))==(int('42.13'[3:6])) or (int('13.42'[3:6]))==(int('42.13'[0:2])))
#program 4th # вариант через целочисленное деление
a = 13.42
b = 42.13
print(a//1==(b-42)*100//1)